# ==========================================
# โจทย์ข้อที่ 3: หาค่ามากที่สุดจากตัวเลข 3 จำนวน
# Input: ตัวเลขจำนวนเต็ม 3 บรรทัด
#        บรรทัดที่ 1 ตัวเลข A
#        บรรทัดที่ 2 ตัวเลข B
#        บรรทัดที่ 3 ตัวเลข C
# Output: ตัวเลขที่มีค่ามากที่สุด
# ตัวอย่าง: A = 15, B = 42, C = 8 -> ผลลัพธ์คือ 42
# ==========================================

# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
number = int( 8 and 15 and 42 )
if number 42:
    print("ตัวเลขที่มีค่ามากสุด")
elif number 15:
    print("ไม่ใช่ตัวเลขที่มีค่าสูงสุด")
elif number 8:
    print("ไม่ใช่ตัวเลขที่มีค่าสูงสุด")
else :
    print("ไม่อยู่ในการกำหนด")
